Sample Case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (0.0000000000000000000000000000000000000 0.0000000000000000000000000000000000000 0.0000000000000000000000000000000000000)
    (0.0105000000000000000000000000000000000 0.0000000000000000000000000000000000000 0.0000000000000000000000000000000000000)
    (0.0105000000000000000000000000000000000 0.0099904822158185784680695107340398000 -0.0004361938736533600268624466522737700)
    (0.0000000000000000000000000000000000000 0.0099904822158185784680695107340398000 -0.0004361938736533600268624466522737700)
    (0.0000000000000000000000000000000000000 0.0099904822158185784680695107340398000 0.0004361938736533600268624466522737700)
    (0.0105000000000000000000000000000000000 0.0099904822158185784680695107340398000 0.0004361938736533600268624466522737700)
	(0.0000000000000000000000000000000000000 0.0005964317882843691177169320738471500 -0.000026040774257105591007023862037961)	//Change for orifice dia//
	(0.0000000000000000000000000000000000000 0.0005964317882843691177169320738471500 0.000026040774257105591007023862037961)	//Change for orifice dia//
	(0.0010000000000000000000000000000000000 0.0005964317882843691177169320738471500 0.000026040774257105591007023862037961)	//Change for orifice dia//
	(0.0010000000000000000000000000000000000 0.0005964317882843691177169320738471500 -0.000026040774257105591007023862037961)	//Change for orifice dia//
	(0.0010000000000000000000000000000000000 0.0039961928863274315607001518912966000 -0.0001744775494613439944819460736269400)
	(0.0010000000000000000000000000000000000 0.0039961928863274315607001518912966000 0.0001744775494613439944819460736269400)
	(0.0105000000000000000000000000000000000 0.0039961928863274315607001518912966000 0.0001744775494613439944819460736269400)
	(0.0105000000000000000000000000000000000 0.0039961928863274315607001518912966000 -0.0001744775494613439944819460736269400)
	(0.0010000000000000000000000000000000000 0.0099904822158185784680695107340398000 -0.0004361938736533600268624466522737700)
	(0.0010000000000000000000000000000000000 0.0099904822158185784680695107340398000 0.0004361938736533600268624466522737700)
	(0.0010000000000000000000000000000000000 0.0000000000000000000000000000000000000 0.0000000000000000000000000000000000000)
	(0.0000000000000000000000000000000000000 0.0039961928863274315607001518912966000 -0.0001744775494613439944819460736269400)
	(0.0000000000000000000000000000000000000 0.0039961928863274315607001518912966000 0.0001744775494613439944819460736269400)
	(0.0000000000000000000000000000000000000 0.0005964317882843691177169320738471500 -0.000026040774257105591007023862037961)	//Copy of pt. 6 - Change for orifice dia//
	(0.0000000000000000000000000000000000000 0.0005964317882843691177169320738471500 0.000026040774257105591007023862037961)	//Copy of pt. 7 - Change for orifice dia//
	(0.0010000000000000000000000000000000000 0.0005964317882843691177169320738471500 0.000026040774257105591007023862037961)	//Copy of pt. 8 - Change for orifice dia//
	(0.0010000000000000000000000000000000000 0.0005964317882843691177169320738471500 -0.000026040774257105591007023862037961)	//Copy of pt. 9 - Change for orifice dia//
	(0.0105000000000000000000000000000000000 0.0005964317882843691177169320738471500 0.000026040774257105591007023862037961)	//Pt.23 - Change for orifice dia//
	(0.0105000000000000000000000000000000000 0.0005964317882843691177169320738471500 -0.000026040774257105591007023862037961)	//Pt.24 - Change for orifice dia//
);

blocks
(
//Orifice Block//								//1mm x 0.597mm//
    hex (0 16 22 19 0 16 21 20) cellZoneName (50 30 1) simpleGrading (1 1 1)		//Fine Grid//
//Block to the left of orifice//				//1mm x 3.403mm//
	hex (6 9 10 17 7 8 11 18) (50 170 1) simpleGrading (1 1 1)						//Fine Grid//
//Block to the far left of orifice//			//1mm x 6mm//
	hex (17 10 14 3 18 11 15 4) (50 100 1) simpleGrading (1 1 1)
//Block above orifice//							//9.5mm x 0.597mm//
	hex (16 1 24 22 16 1 23 21) (475 30 1) simpleGrading (1 1 1)					//Fine Grid//
//Block above orifice and to the left//			//9.5mm x 3.403mm/
	hex (9 24 13 10 8 23 12 11) (475 170 1) simpleGrading (1 1 1)					//Fine Grid//
//Block above orifice and to the far left//		//9.5mm x 6mm//
	hex (10 13 2 14 11 12 5 15) (475 100 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
	upperwall
    {
        type wall;
        faces
        (
            (3 4 15 14)
			(14 15 5 2)
        );
    }
	lowerwall
    {
        type wall;
        faces
        (
            (6 7 18 17)
			(17 18 4 3)
        );
    }
	pressure_outlet
    {
        type patch;
        faces
        (
            (1 23 24 1)
			(24 23 12 13)
			(13 12 5 2)
        );
    }
	orificewall
    {
        type wall;
        faces
        (
            (6 7 8 9)
			(19 20 21 22)
        );
    }
	airinlet
    {
        type patch;
        faces
        (
            (0 20 19 0)
        );
    }
	axis
    {
        type empty;
        faces
        (
            (0 16 16 0)
			(16 1 1 16)
        );
    }
	frontPlane
    {
        type wedge;
        faces
        (
            (0 16 21 20)
			(16 1 23 21)
			(8 23 12 11)
			(11 12 5 15)
			(7 8 11 18)
			(18 11 15 4)
        );
    }
	backPlane
    {
        type wedge;
        faces
        (
            (0 16 22 19)
			(16 1 24 22)
			(9 24 13 10)
			(10 13 2 14)
			(6 9 10 17)
			(17 10 14 3)
		);
    }
	masterpatch
    {
        type patch;
        faces
        (
            (22 21 23 24)
        );
    }
	slavepatch
    {
        type patch;
        faces
        (
            (9 8 23 24)
        );
    }
);

mergePatchPairs
(
		(masterpatch slavepatch)
);

// ************************************************************************* //