Sample Case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    upperwall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          525;
        startFace       314125;
    }
    lowerwall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          270;
        startFace       314650;
    }
    pressure_outlet
    {
        type            patch;
        nFaces          300;
        startFace       314920;
    }
    orificewall
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          100;
        startFace       315220;
    }
    airinlet
    {
        type            patch;
        nFaces          30;
        startFace       315320;
    }
    frontPlane
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          157500;
        startFace       315350;
    }
    backPlane
    {
        type            wedge;
        inGroups        List<word> 1(wedge);
        nFaces          157500;
        startFace       472850;
    }
)

// ************************************************************************* //
