Sample Case/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (water air);

water
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 4.8166e-05;
    rho             rho [ 1 -3 0 0 0 0 0 ] 1036;
}

air
{
    transportModel  Newtonian;
    nu              nu [ 0 2 -1 0 0 0 0 ] 1.7894e-05;
    rho             rho [ 1 -3 0 0 0 0 0 ] 1.225;
}

sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.035;
deltaX          deltaX [ 0 0 0 0 0 0 0 ] 0.00002;
epsilon         epsilon [ 0 0 0 0 0 0 0 ] 0.00003; //1.5*deltaX

// ************************************************************************* //
