Sample Case/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
	upperwall
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
	lowerwall
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
	pressure_outlet
    {
        type            totalPressure;
        p0              uniform 0;
    }
	orificewall
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    airinlet
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
    frontPlane
    {
        type            wedge;
    }
    backPlane
    {
        type            wedge;
    }
}

// ************************************************************************* //
